
## Plan Result (ithc)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 4 to change, 2 to destroy.</code></pre>

* Update
  * module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0]
  * module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0]
* Replace
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.sdp_db_user.data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-ithc"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-ithc-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-ithc.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-name/718212b8661f46b7b5210f2faf7a016b" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.KeyVault/vaults/mi-vault-ithc" -> (known after apply) # forces replacement
        name                    = "cft-task-postgres-db-flexible-replica-read-user-name"
      ~ resource_id             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.KeyVault/vaults/mi-vault-ithc/secrets/cft-task-postgres-db-flexible-replica-read-user-name/versions/718212b8661f46b7b5210f2faf7a016b" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.KeyVault/vaults/mi-vault-ithc/secrets/cft-task-postgres-db-flexible-replica-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "718212b8661f46b7b5210f2faf7a016b" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-ithc.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-ithc.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-password/74e12d1e9b524dbbaad0c9e99fa64539" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.KeyVault/vaults/mi-vault-ithc" -> (known after apply) # forces replacement
        name                    = "cft-task-postgres-db-flexible-replica-read-user-password"
      ~ resource_id             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.KeyVault/vaults/mi-vault-ithc/secrets/cft-task-postgres-db-flexible-replica-read-user-password/versions/74e12d1e9b524dbbaad0c9e99fa64539" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/mi-ithc-rg/providers/Microsoft.KeyVault/vaults/mi-vault-ithc/secrets/cft-task-postgres-db-flexible-replica-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "74e12d1e9b524dbbaad0c9e99fa64539" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-ithc.vault.azure.net/secrets/cft-task-postgres-db-flexible-replica-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/cft-task-postgres-db-flexible-data-ithc/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-ithc"
        name                          = "cft-task-postgres-db-flexible-ithc"
      ~ tags                          = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "ithc"
          - "lastUpdated"         = "2025-01-22T13:37:30Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/cft-task-postgres-db-flexible-data-ithc"
        name       = "cft-task-postgres-db-flexible-data-ithc"
      ~ tags       = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "ithc"
          - "lastUpdated"         = "2025-01-22T13:37:30Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/cft-task-postgres-db-flexible-replica-data-ithc/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-task-postgres-db-flexible-replica-ithc"
        name                          = "cft-task-postgres-db-flexible-replica-ithc"
      ~ tags                          = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "ithc"
          - "lastUpdated"         = "2025-01-22T13:37:30Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.wa_task_management_api_database_flexible_replica.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/cft-task-postgres-db-flexible-replica-data-ithc"
        name       = "cft-task-postgres-db-flexible-replica-data-ithc"
      ~ tags       = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-task-management-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "ithc"
          - "lastUpdated"         = "2025-01-22T13:37:30Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1382,"Program":"tfcmt","SHA1":"","Target":"ithc","Vars":{}} -->